#include "menu.hpp"
#include <iostream>
using namespace std;

void printMenu_1() {
  cout << "____________________________________________________________________"
          "____\n";
  cout << "| МЕНЮ:                                                             "
          "   |\n";
  cout << "|-------------------------------------------------------------------"
          "---|\n";
  cout << "|'0' - выход;                                                       "
          "   |\n";
  cout << "|'1' - создать пустую матрицу;                                      "
          "   |\n";
  cout << "|___________________________________________________________________"
          "___|\n> ";
}

void printMenu_2() {
  cout << "\n__________________________________________________________________"
          "______\n";
  cout << "| МЕНЮ:                                                             "
          "   |\n";
  cout << "|-------------------------------------------------------------------"
          "---|\n";
  cout << "|'0' - выход;                                                       "
          "   |\n";
  cout << "|'1' - заполнить матрицу;                                           "
          "   |\n";
  cout << "|'2' - вывод текущей матрицы на экран;                              "
          "   |\n";
  cout << "|'3' - добавить новую матрицу;                                      "
          "   |\n";
  cout << "|___________________________________________________________________"
          "___|\n> ";
}

void printMenu_3() {
  cout << "\n__________________________________________________________________"
          "______\n";
  cout << "| МЕНЮ:                                                             "
          "   |\n";
  cout << "|-------------------------------------------------------------------"
          "---|\n";
  cout << "|'0' - выход;                                                       "
          "   |\n";
  cout << "|'1' - вычитание двух первых матриц(от первой вторую);              "
          "   |\n";
  cout << "|'2' - вывод матрицы результата операции вычитания матриц на экран; "
          "   |\n";
  cout << "|'3' - вычитание двух первых матриц(от второй первую);              "
          "   |\n";
  cout << "|___________________________________________________________________"
          "___|\n> ";
}